In [1]:
import pandas as pd
import numpy as np

In [42]:
t1 = pd.read_csv("C:/Users/Arkaprabha_B/Desktop/train1.csv")

In [43]:
t1.head(2)

   Employee Number Employee Name Employee Department
0             1001           ABC                  HR
1             1002           XYZ             Finance

In [44]:
t2 = pd.read_csv("C:/Users/Arkaprabha_B/Desktop/train2.csv")

In [45]:
t2.head()

   Employee Job Level  Employee Salary
0                   1            50000
1                   2            80000
2                   3           125000

In [46]:
t3 = pd.read_csv("C:/Users/Arkaprabha_B/Desktop/train3.csv")

In [47]:
t3.head()

   Employee Id   Employee Job Level
0          1001                   1
1          1002                   1
2          1003                   1
3          1004                   3
4          1005                   2

In [48]:
t1.rename(columns = {'Employee Number':'Empid'}, inplace = True) 
t3.rename(columns = {'Employee Id ':'Empid'}, inplace = True)

In [49]:
t1.columns

Index(['Empid', 'Employee Name', 'Employee Department'], dtype='object')

In [50]:
t3.columns

Index(['Empid', 'Employee Job Level'], dtype='object')

In [51]:
dfs = [t1,t3]
from functools import reduce
df_final2 = reduce(lambda left,right: pd.merge(left,right,on='Empid'), dfs)
EmpID = df_final2['Empid']

In [52]:
df_final2

   Empid Employee Name Employee Department  Employee Job Level
0   1001           ABC                  HR                   1
1   1002           XYZ             Finance                   1
2   1003           PQR                  HR                   1
3   1004        Ramesh               Sales                   3
4   1005        Suresh             Finance                   2
5   1006           DEF                  HR                   2

In [53]:
t2.rename(columns = {'Employee Job Level':'JL'}, inplace = True)
df_final2.rename(columns = {'Employee Job Level':'JL'}, inplace = True)

In [54]:
t2.columns

Index(['JL', 'Employee Salary'], dtype='object')

In [55]:
df_final2.columns

Index(['Empid', 'Employee Name', 'Employee Department', 'JL'], dtype='object')

In [56]:
df3 = [df_final2,t2]
from functools import reduce
df_final = reduce(lambda left,right: pd.merge(left,right,on='JL'), df3)
EmpID = df_final['JL']

In [57]:
df_final

   Empid Employee Name Employee Department  JL  Employee Salary
0   1001           ABC                  HR   1            50000
1   1002           XYZ             Finance   1            50000
2   1003           PQR                  HR   1            50000
3   1004        Ramesh               Sales   3           125000
4   1005        Suresh             Finance   2            80000
5   1006           DEF                  HR   2            80000